---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookStyle
source: html/aabec7de-ec39-fce8-c9f1-9f3c353ae337.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookStyle Property

"Style"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookStyle { get; }
```